V1/Data/ambient/240-3-wrk2-xndd2.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 11.688ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 12.164ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 12.100ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 11.586ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 11.971ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 11.675ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 12.112ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 11.631ms, rate sampling interval: 34ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.47ms    2.27ms  28.38ms   71.97%
    Req/Sec    10.04     41.95   300.00     94.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.13ms
 75.000%   11.73ms
 90.000%   13.41ms
 99.000%   17.33ms
 99.900%   21.58ms
 99.990%   25.30ms
 99.999%   28.40ms
100.000%   28.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.859     0.000000            1         1.00
       7.915     0.100000         2317         1.11
       8.615     0.200000         4620         1.25
       9.127     0.300000         6910         1.43
       9.623     0.400000         9205         1.67
      10.127     0.500000        11525         2.00
      10.415     0.550000        12663         2.22
      10.703     0.600000        13815         2.50
      11.007     0.650000        14966         2.86
      11.343     0.700000        16110         3.33
      11.735     0.750000        17281         4.00
      11.935     0.775000        17848         4.44
      12.167     0.800000        18412         5.00
      12.407     0.825000        18994         5.71
      12.679     0.850000        19574         6.67
      13.007     0.875000        20147         8.00
      13.191     0.887500        20430         8.89
      13.407     0.900000        20724        10.00
      13.615     0.912500        21004        11.43
      13.887     0.925000        21287        13.33
      14.199     0.937500        21573        16.00
      14.391     0.943750        21720        17.78
      14.575     0.950000        21866        20.00
      14.815     0.956250        22010        22.86
      15.071     0.962500        22152        26.67
      15.375     0.968750        22293        32.00
      15.583     0.971875        22364        35.56
      15.807     0.975000        22436        40.00
      16.055     0.978125        22509        45.71
      16.295     0.981250        22581        53.33
      16.575     0.984375        22653        64.00
      16.703     0.985938        22688        71.11
      16.943     0.987500        22724        80.00
      17.167     0.989062        22760        91.43
      17.487     0.990625        22798       106.67
      17.759     0.992188        22835       128.00
      18.031     0.992969        22850       142.22
      18.303     0.993750        22868       160.00
      18.703     0.994531        22886       182.86
      19.023     0.995313        22905       213.33
      19.359     0.996094        22922       256.00
      19.551     0.996484        22931       284.44
      19.759     0.996875        22942       320.00
      19.903     0.997266        22949       365.71
      20.287     0.997656        22959       426.67
      20.559     0.998047        22968       512.00
      20.783     0.998242        22971       568.89
      20.975     0.998437        22976       640.00
      21.103     0.998633        22980       731.43
      21.439     0.998828        22985       853.33
      21.583     0.999023        22989      1024.00
      21.791     0.999121        22991      1137.78
      22.383     0.999219        22994      1280.00
      22.799     0.999316        22996      1462.86
      22.943     0.999414        22998      1706.67
      23.343     0.999512        23000      2048.00
      23.359     0.999561        23001      2275.56
      23.535     0.999609        23003      2560.00
      23.583     0.999658        23004      2925.71
      23.711     0.999707        23005      3413.33
      24.367     0.999756        23006      4096.00
      24.367     0.999780        23006      4551.11
      24.415     0.999805        23007      5120.00
      24.559     0.999829        23008      5851.43
      24.559     0.999854        23008      6826.67
      25.295     0.999878        23009      8192.00
      25.295     0.999890        23009      9102.22
      25.295     0.999902        23009     10240.00
      27.199     0.999915        23010     11702.86
      27.199     0.999927        23010     13653.33
      27.199     0.999939        23010     16384.00
      27.199     0.999945        23010     18204.44
      27.199     0.999951        23010     20480.00
      28.399     0.999957        23011     23405.71
      28.399     1.000000        23011          inf
#[Mean    =       10.471, StdDeviation   =        2.266]
#[Max     =       28.384, Total count    =        23011]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24008 requests in 5.00m, 11.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 6000
Requests/sec:     80.02
Transfer/sec:     39.92KB