V1/Data/ambient/60-2-wrk2-84wsz.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 25.278ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 24.528ms, rate sampling interval: 77ms
  Thread calibration: mean lat.: 24.201ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 23.829ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 24.790ms, rate sampling interval: 77ms
  Thread calibration: mean lat.: 22.994ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 25.355ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 34.800ms, rate sampling interval: 86ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.35ms    7.62ms  50.43ms   73.17%
    Req/Sec     2.44     20.49   294.00     98.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.58ms
 75.000%   25.66ms
 90.000%   34.11ms
 99.000%   44.29ms
 99.900%   48.48ms
 99.990%   49.79ms
 99.999%   50.46ms
100.000%   50.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.467     0.000000            1         1.00
      14.335     0.100000          566         1.11
      16.255     0.200000         1133         1.25
      17.823     0.300000         1699         1.43
      19.231     0.400000         2265         1.67
      20.575     0.500000         2828         2.00
      21.295     0.550000         3114         2.22
      22.239     0.600000         3390         2.50
      23.199     0.650000         3677         2.86
      24.319     0.700000         3955         3.33
      25.663     0.750000         4242         4.00
      26.463     0.775000         4381         4.44
      27.535     0.800000         4520         5.00
      28.703     0.825000         4663         5.71
      29.967     0.850000         4803         6.67
      32.079     0.875000         4945         8.00
      33.087     0.887500         5015         8.89
      34.111     0.900000         5085        10.00
      35.519     0.912500         5156        11.43
      36.607     0.925000         5229        13.33
      37.663     0.937500         5297        16.00
      38.207     0.943750         5333        17.78
      39.039     0.950000         5368        20.00
      39.647     0.956250         5403        22.86
      40.351     0.962500         5439        26.67
      40.927     0.968750         5475        32.00
      41.279     0.971875         5494        35.56
      41.727     0.975000         5509        40.00
      41.983     0.978125         5529        45.71
      42.527     0.981250         5545        53.33
      43.135     0.984375         5563        64.00
      43.391     0.985938         5572        71.11
      43.615     0.987500         5580        80.00
      44.127     0.989062         5589        91.43
      44.447     0.990625         5599       106.67
      45.023     0.992188         5606       128.00
      45.311     0.992969         5611       142.22
      45.567     0.993750         5615       160.00
      45.951     0.994531         5620       182.86
      46.399     0.995313         5624       213.33
      46.751     0.996094         5630       256.00
      46.879     0.996484         5631       284.44
      46.975     0.996875         5634       320.00
      47.199     0.997266         5635       365.71
      47.551     0.997656         5638       426.67
      47.679     0.998047         5639       512.00
      47.935     0.998242         5641       568.89
      48.127     0.998437         5642       640.00
      48.447     0.998633         5643       731.43
      48.479     0.998828         5644       853.33
      48.575     0.999023         5645      1024.00
      49.631     0.999121         5646      1137.78
      49.631     0.999219         5646      1280.00
      49.695     0.999316         5647      1462.86
      49.695     0.999414         5647      1706.67
      49.727     0.999512         5648      2048.00
      49.727     0.999561         5648      2275.56
      49.727     0.999609         5648      2560.00
      49.791     0.999658         5649      2925.71
      49.791     0.999707         5649      3413.33
      49.791     0.999756         5649      4096.00
      49.791     0.999780         5649      4551.11
      49.791     0.999805         5649      5120.00
      50.463     0.999829         5650      5851.43
      50.463     1.000000         5650          inf
#[Mean    =       22.351, StdDeviation   =        7.617]
#[Max     =       50.432, Total count    =         5650]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6008 requests in 5.00m, 2.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 24000
Requests/sec:     20.02
Transfer/sec:     10.00KB