V1/Data/ambient/60-5-wrk2-7g5cc.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 10.303ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.973ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 10.144ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 10.448ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 10.733ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 10.364ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 10.566ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 16.688ms, rate sampling interval: 37ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.80ms    3.20ms  24.21ms   77.98%
    Req/Sec     2.46     24.52   694.00     98.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.73ms
 75.000%   10.69ms
 90.000%   14.70ms
 99.000%   20.75ms
 99.900%   22.96ms
 99.990%   24.01ms
 99.999%   24.22ms
100.000%   24.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.851     0.000000            1         1.00
       6.955     0.100000          564         1.11
       7.459     0.200000         1132         1.25
       7.895     0.300000         1690         1.43
       8.295     0.400000         2258         1.67
       8.727     0.500000         2825         2.00
       8.983     0.550000         3107         2.22
       9.263     0.600000         3381         2.50
       9.583     0.650000         3663         2.86
      10.007     0.700000         3943         3.33
      10.687     0.750000         4225         4.00
      11.223     0.775000         4365         4.44
      11.911     0.800000         4509         5.00
      12.783     0.825000         4647         5.71
      13.415     0.850000         4788         6.67
      14.119     0.875000         4931         8.00
      14.383     0.887500         4999         8.89
      14.703     0.900000         5071        10.00
      14.975     0.912500         5140        11.43
      15.343     0.925000         5211        13.33
      15.735     0.937500         5280        16.00
      16.063     0.943750         5316        17.78
      16.447     0.950000         5352        20.00
      16.767     0.956250         5386        22.86
      17.247     0.962500         5421        26.67
      17.887     0.968750         5457        32.00
      18.271     0.971875         5474        35.56
      18.671     0.975000         5492        40.00
      18.959     0.978125         5509        45.71
      19.519     0.981250         5527        53.33
      19.855     0.984375         5544        64.00
      20.079     0.985938         5553        71.11
      20.383     0.987500         5562        80.00
      20.671     0.989062         5571        91.43
      20.927     0.990625         5580       106.67
      21.455     0.992188         5589       128.00
      21.599     0.992969         5593       142.22
      21.775     0.993750         5597       160.00
      22.031     0.994531         5602       182.86
      22.143     0.995313         5606       213.33
      22.303     0.996094         5610       256.00
      22.447     0.996484         5613       284.44
      22.495     0.996875         5615       320.00
      22.527     0.997266         5617       365.71
      22.687     0.997656         5619       426.67
      22.767     0.998047         5621       512.00
      22.815     0.998242         5623       568.89
      22.831     0.998437         5625       640.00
      22.831     0.998633         5625       731.43
      22.959     0.998828         5626       853.33
      23.087     0.999023         5627      1024.00
      23.103     0.999121         5628      1137.78
      23.103     0.999219         5628      1280.00
      23.375     0.999316         5629      1462.86
      23.375     0.999414         5629      1706.67
      23.727     0.999512         5630      2048.00
      23.727     0.999561         5630      2275.56
      23.727     0.999609         5630      2560.00
      24.015     0.999658         5631      2925.71
      24.015     0.999707         5631      3413.33
      24.015     0.999756         5631      4096.00
      24.015     0.999780         5631      4551.11
      24.015     0.999805         5631      5120.00
      24.223     0.999829         5632      5851.43
      24.223     1.000000         5632          inf
#[Mean    =        9.796, StdDeviation   =        3.200]
#[Max     =       24.208, Total count    =         5632]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6007 requests in 5.00m, 2.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 24000
Requests/sec:     20.01
Transfer/sec:      9.98KB